# Pandas Week 3 - Joshua Lewi (2473018)

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

### 9. Membagi Data Frame menjadi 2 secara acak

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df

    A   B   C   D   E
0   9  18  15   5   6
1  16  11   6   6  11
2  10  17   5  13   7
3  16  11  10   8  10
4  19   4  10   4  18
5   8   4  19   5  17
6   1  18   2   2   8
7  15  11   4  14   2
8  10  12   8   1   6
9  12  12  11   8  19

In [4]:
#Langkah 1 - cek dlu df shapenya
df.shape

(10, 5)

In [ ]:
#Langkah 2 - bagi jadi 2 bagian, 70% dan 30%
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index) #drop index yg ada di df_1

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [6]:
df_1

    A   B   C   D   E
2  10  17   5  13   7
1  16  11   6   6  11
6   1  18   2   2   8
3  16  11  10   8  10
8  10  12   8   1   6
0   9  18  15   5   6
4  19   4  10   4  18

In [7]:
df_2

    A   B   C   D   E
5   8   4  19   5  17
7  15  11   4  14   2
9  12  12  11   8  19

### 10. Mengganti nama kolom pada Data Frame berdasarkan pola

In [16]:
df = pd.read_csv('https://raw.githubusercontent.com/boedybios/kaggle_explorations/refs/heads/master/belajar_matplotlib_dasar/data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex ', ' Age', 'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup =df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [17]:
#menggunakan lowercase untuk nama kolom & mengganti spasi dengan "_"
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [ ]:
#Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)  #kembalikan df ke kondisi awal
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_') #str.strip akan membuang spasi yang berlebihan (di awal age atau setelah sex)
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### 11. Seleksi kolom dan baris pada Data Frame menggunakan loc

In [19]:
n_rows= 10
n_cols= 5
cols= tuple('ABCDE')
df= pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df

    A   B   C   D   E
0   7   5  14  13  12
1   3   4   7   8  17
2   7   1   8  13  11
3  19   2  12  14   8
4   4   6  13   7   2
5  10   3  11   9  12
6   9   7  17   2   5
7  18  12  13  17  15
8  10   2   8  15  14
9   5   9   6  16  17

In [ ]:
#Seleksi kolom dan baris pake loc
df.loc[[0,3,4], ['B','E']] #kiri: baris, kanan: kolom

   B   E
0  5  12
3  2   8
4  6   2

In [21]:
#Seleksi dengan kondisi
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
7  12  17  15

In [24]:
df.loc[0:4, 'B':'D'] #teknik slicing, kolom B sampai D, baris 0 sampai 4
#sifatnya inklusif untuk slicingnya, semuanya di include.

   B   C   D
0  5  14  13
1  4   7   8
2  1   8  13
3  2  12  14
4  6  13   7

### 12. Membentuk kolom bertipe datetime dari beberapa kolom lain.

In [25]:
data = {
    'day': [1, 2, 10, 25, 12],
    'month': [1, 2, 4, 5, 6],
    'year': [2000, 2001, 2010, 2015, 2020]}
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [28]:
df['penanggalan'] = pd.to_datetime(df[['day', 'month', 'year']]) #nama kolom gaboleh sembarangan. ga bisa pake bahasa lain, harus day, month, year
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [27]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object